//======================================================================
//! @file   sd.c
//! @brief  SDカードアクセス
//======================================================================
#include <stdint.h>

#include "global.h"
#include "sd.h"
#include "setup.h"

//----- プロトタイプ宣言 -----
static void SetNormalSpi(void);																// 通常時SPI設定

//----------------------------------------------------------------------
//! @brief  SD初期設定
//! @return	RET_OK		成功
//! @note   起動時に1回だけ呼ぶ.単一のタスクから呼ぶこと.
//! 		ピンが競合しているデバイスの中で一番最初に呼ぶこと.
//----------------------------------------------------------------------
int sd_Initialize(void)
{
	return RET_OK;
}

//----------------------------------------------------------------------
//! @brief  未初期化状態へ
//! @note	未使用.動作未チェック
//----------------------------------------------------------------------
void sd_Deinitialize(void)
{
}

//----------------------------------------------------------------------
//! @brief  マウント
//! @return	RET_OK		成功
//----------------------------------------------------------------------
int sd_Mount(void)
{
	set_TakeCommunicationMutex();
	SetNormalSpi();

	// SD関連のSPI 通信する.Mutexしているので同時アクセスに対して安全.

	set_GiveCommunicationMutex();
	return RET_OK;
}

//----------------------------------------------------------------------
//! @brief  アンマウント
//! @note	未使用.動作未チェック
//----------------------------------------------------------------------
void sd_Unmount(void)
{
}

//----------------------------------------------------------------------
//! @brief  通常時SPI設定
//! @note	set_SetPin()内PinSetting_SdMainの設定値を変えたら
//! 		normalSpiSpeedHzの値も変えること.
//----------------------------------------------------------------------
void SetNormalSpi(void)
{
	//----- SPI速度設定 -----
	set_SetPin(PinSetting_SdMain, NULL);
}
